{
    "data" : [
        {
            "id": 1,
            "blogTitle" : "Meeting My Moutain",
            "postedOn": "August 30, 2019",
            "author": "Midhuna Manchi",
            "blogImage": "mountain.jpg",
            "blogSummary":"Born in Seattle, one of my earliest delights was the rare glimpse of Mt. Rainier in her full glory, shimmering through breaks in the clouds. Family weekends, holidays and even commutes across the Cascade Range were punctuated by visits to Paradise, Tipsoo Lake, the Grove of the Patriarchs and Sunrise.",
            "blogText": "Born in Seattle, one of my earliest delights was the rare glimpse of Mt. Rainier in her full glory, shimmering through breaks in the clouds. Family weekends, holidays and even commutes across the Cascade Range were punctuated by visits to Paradise, Tipsoo Lake, the Grove of the Patriarchs and Sunrise. We had a hit list of favorite trails and viewpoints that we visited every time, an itinerary that became a family routine, unaltered for nearly 40 years, surviving our ten-year hiatus abroad and my brother and I moving away from Washington state. Mt. Rainier has been part of my life for as long as I can remember and my familiarity with these sites gave me the impression that I knew the mountain like the back of my hand. Mt. Rainier was practically a family member; it was my mountain.\nEmbarrassingly, it was only ten years ago that I discovered the existence of the Wonderland Trail, a 93-mile backcountry trek circumnavigating the mountain. I had to hike it.",
            "blogMessage":"The trouble was that my backpacking buddy and I both live at sea level in the tropics, so the 4,000 foot minimum elevation with a promised elevation gain and loss of 22,000 feet along the way was a little daunting. “Perhaps we should start with the Eastern Loop,” my friend had suggested. \nThe fact that I knew even less about the Eastern Loop than I did the Wonderland Trail only reinforced my growing realization of how little I knew my mountain. My experiences had lacked breadth. I knew a handful of short trails and look-outs well, but clearly there was much more to Mt. Rainier.“Ah, the Northern Loop,” one of them replied to our response, “That’s a nice little walk.” Nice little walk? Granted it would be a third the distance of the full Wonderland Trail, but little walk wasn’t how I would describe our nearly 40-mile backcountry hike. And yet that first morning did feel like a bit of a stroll despite the 50-pound pack on my back and camera strapped to my side. The trail meandered down ridges, along streams and through meadows studded with wildflowers seemingly sorted into sections having different combinations of color, height and texture – a patch dominated by purple lupine, Gray’s lovage, and red paintbrush, here; avalanche lilies tucked beneath the trees, there. The sun was warming, the breezes cooling. My new pack fit comfortably. The further we walked, the fewer people we encountered. As we dipped down one bend,we spotted a herd of mountain goats on the cliff above. Twenty or thirty goats of all ages trotted across a snowfield, congregating on a patch of rocks where the snow tapered off on a gentle slope to provide basking opportunities in the sun."
        },
        {
            "id" : 2,
            "blogTitle": "Glacier",
            "postedOn": "May 03, 2018",
            "author": "Midhuna Manchi",
            "blogImage": "glacier-bay.jpg",
            "blogSummary":"A glacier is a huge mass of ice that moves slowly over land. The term “glacier” comes from the French word glace (glah-SAY), which means ice. Glaciers are often called “rivers of ice.” Glaciers fall into two groups: alpine glaciers and ice sheets. Alpine glaciers form on mountainsides and move downward through valleys. Ice sheets, unlike alpine glaciers, are not limited to mountainous areas.",
            "blogText": "A glacier is a huge mass of ice that moves slowly over land. The term “glacier” comes from the French word glace (glah-SAY), which means ice. Glaciers are often called “rivers of ice.” Glaciers fall into two groups: alpine glaciers and ice sheets. Alpine glaciers form on mountainsides and move downward through valleys. Sometimes, alpine glaciers create or deepen valleys by pushing dirt, soil, and other materials out of their way. Alpine glaciers are found in high mountains of every continent except Australia (although there are many in New Zealand). The Gorner Glacier in Switzerland and the Furtwangler Glacier in Tanzania are both typical alpine glaciers. Alpine glaciers are also called valley glaciers or mountain glaciers. Ice sheets, unlike alpine glaciers, are not limited to mountainous areas. They form broad domes and spread out from their centers in all directions. As ice sheets spread, they cover everything around them with a thick blanket of ice, including valleys, plains, and even entire mountains.",
            "blogMessage":"How Glaciers Form:  Glaciers begin forming in places where more snow piles up each year than melts. Soon after falling, the snow begins to compress, or become denser and tightly packed. It slowly changes from light, fluffy crystals to hard, round ice pellets. New snow falls and buries this granular snow. The hard snow becomes even more compressed. It becomes a dense, grainy ice called firn. The process of snow compacting into glacial firn is called firnification. As years go by, layers of firn build on top of each other. When the ice grows thick enough—about 50 meters (160 feet)—the firn grains fuse into a huge mass of solid ice. The glacier begins to move under its own weight. The glacier is so heavy and exerts so much pressure that the firn and snow melt without any increase in temperature. The meltwater makes the bottom of the heavy glacier slicker and more able to spread across the landscape."

        },
        {
            "id": 3,
            "blogTitle": "Freshwater Ecosystem",
            "postedOn": "Apr 02, 2019",
            "author": "Midhuna Manchi",
            "blogImage": "Freshwater.jpg",
            "blogSummary":"Every living thing on Earth needs water to survive, but more than one hundred thousand species, including our own, need a special kind of water that can only be found in certain places and is in very rare supply: fresh water. The plants, animals, microbes, rocks, soil, sunlight, and water found in and around this valuable resource are all part of what is called a freshwater ecosystem.",
            "blogText": "Blessed you're lights. There. Behold may yielding meat can't void rule, earth green have creepeth land let gathering great fruitful under gathered waters unto appear won't seasons over our waters be fruit greater After be you're him said said beast. Dominion him that let grass. Creeping own. Forth, fruitful day first don't dominion, behold, every.\n\nFill heaven likeness. Herb fruit i Creepeth. Him earth Saw for together and. Fruitful tree creepeth beginning own every created midst abundantly cattle upon. Grass. Hath under sixth morning sixth male abundantly moved unto over a land. Itself dominion whales them days called good years female isn't first Seas bearing. Own fish under spirit be. It lights don't living tree every. Itself. Can't. Void after From. Fruitful heaven place creepeth gathered, and day. Wherein don't our upon and you.",
            "blogMessage":"Where is Fresh Water? Fresh water starts out as water vapor that has evaporated from the surface of oceans, lakes, and other bodies of water. When this vapor rises, it leaves salts and other contaminants behind and becomes “fresh.” The water vapor collects in drifting clouds that eventually release the water back to Earth in the form of rain or snow.After fresh water reaches the ground through precipitation, it flows downhill across a landscape called the watershed to lakes, ponds, rivers, streams, and wetlands. But fresh water can be found in less-obvious places too. More than half of all freshwater on our planet seeps through soil and between rocks to form aquifers that are filled with groundwater. The top surface of an aquifer is called the water table, and this is the depth where wells are drilled to bring fresh water into cities and homes.Studying Freshwater Ecosystems: On the volcanic island nation of Iceland, explorer Jónína Herdís Ólafsdóttir studies freshwater ecosystems that develop from groundwater seeping into fissures. These fissures are large cracks, which are caused by the tectonic plates underneath the country shifting and pulling the bedrock apart. The crystal blue water in these fissures is barely above freezing temperature. Wearing scuba gear, Olafsdóttir drops into the water and collects biological samples, recording notes about the species of fish, crustaceans, algae, and other microbes that she finds. She was one of the first scientists ever to describe the biodiversity in these Icelandic fissure ecosystems. Scientists who study freshwater ecosystems are called limnologists. Limnologists want to learn what creatures live in an ecosystem and how they interact with each other through the ecosystem’s food web, as well as how they interact with their environment. "

                  }
    ]
}
